//Создать приложение «Магазин комиксов».
//Основная задача проекта: учитывать текущий ассортимент комиксов в магазине.
//Необходимо хранить следующую информацию о комиксах: название комикса, ФИО художника/автора, название издательства комикса, количество страниц, жанр, год издания, себестоимость, цена для продажи, является ли комикс про-должением какого-то другого комикса или серии комиксов.
//Приложение должно позволять: добавлять комиксы, удалять комиксы, редак-тировать параметры комиксов,
//продавать комиксы, списывать комиксы,
//вносить комиксы в акции (например, неделя комиксов новогодней тематики со скидкой 10% или скидки к черной пятнице),
//откладывать комиксы для конкретного поку-пателя.
//Приложение должно предоставить функциональность по поиску комиксов по таким параметрам: название комикса, художник/автор, жанр.
//Приложение должно предоставлять возможность просмотреть список новинок,
//список самых продаваемых комиксов,
//список самых популярных художников/авторов,
//TODO список самых популярных жанров по итогам дня, недели, месяца, года. =(


//Информация из приложения должна сохраняться и загружаться из файлов.
//необходимо предусмотреть возможность входа по логину и паролю.
//Поле "Вывод списка" должно перекачивать в "Поиск"


